<?php

namespace Database\Seeders;

use App\Models\Blog;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class BlogSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Blog::create(['category_id'=>1, 'image'=> 'blog1.jpg',
            'ar' => [
            'name' => 'ذكرى ال53 حادثة احراق المسجد الاقصى',
            'name_slug' => 'ذكرى ال53 حادثة احراق المسجد الاقصى',
            'meta_title' => 'ذكرى ال53 حادثة احراق المسجد الاقصى',
            'meta_description' => 'ذكرى ال53 حادثة احراق المسجد الاقصى',
            'keywords' => 'ذكرى ال53 حادثة احراق المسجد الاقصى',
            'image_alt' => 'ذكرى ال53 حادثة احراق المسجد الاقصى',
            'description' => 'ذكرى ال53 حادثة احراق المسجد الاقصى'],
            'en' => [
                'name' => 'ذكرى ال53 حادثة احراق المسجد الاقصى',
                'name_slug' => 'ذكرى ال53 حادثة احراق المسجد الاقصى',
                'meta_title' => 'ذكرى ال53 حادثة احراق المسجد الاقصى',
                'meta_description' => 'ذكرى ال53 حادثة احراق المسجد الاقصى',
                'keywords' => 'ذكرى ال53 حادثة احراق المسجد الاقصى',
                'image_alt' => 'ذكرى ال53 حادثة احراق المسجد الاقصى',
                'description' => 'ذكرى ال53 حادثة احراق المسجد الاقصى'],
            'tr' => [
                'name' => 'ذكرى ال53 حادثة احراق المسجد الاقصى',
                'name_slug' => 'ذكرى ال53 حادثة احراق المسجد الاقصى',
                'meta_title' => 'ذكرى ال53 حادثة احراق المسجد الاقصى',
                'meta_description' => 'ذكرى ال53 حادثة احراق المسجد الاقصى',
                'keywords' => 'ذكرى ال53 حادثة احراق المسجد الاقصى',
                'image_alt' => 'ذكرى ال53 حادثة احراق المسجد الاقصى',
                'description' => 'ذكرى ال53 حادثة احراق المسجد الاقصى'],
        ]);

        Blog::create(['category_id'=>1, 'image'=> 'blog2.jpeg',
            'ar' => [
                'name' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"',
                'name_slug' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"',
                'meta_title' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"',
                'meta_description' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"',
                'keywords' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"',
                'image_alt' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"',
                'description' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"'],
            'en' => [
                'name' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"',
                'name_slug' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"',
                'meta_title' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"',
                'meta_description' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"',
                'keywords' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"',
                'image_alt' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"',
                'description' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"'],
            'tr' => [
                'name' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"',
                'name_slug' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"',
                'meta_title' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"',
                'meta_description' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"',
                'keywords' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"',
                'image_alt' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"',
                'description' => 'مؤسسة منبر الأقصى تطلق حملة دولية "عبادا لنا"'],
        ]);

        Blog::create(['category_id'=>1, 'image'=> 'blog3.png',
            'ar' => [
                'name' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"',
                'name_slug' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"',
                'meta_title' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"',
                'meta_description' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"',
                'keywords' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"',
                'image_alt' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"',
                'description' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"'],
            'en' => [
                'name' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"',
                'name_slug' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"',
                'meta_title' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"',
                'meta_description' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"',
                'keywords' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"',
                'image_alt' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"',
                'description' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"'],
            'tr' => [
                'name' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"',
                'name_slug' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"',
                'meta_title' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"',
                'meta_description' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"',
                'keywords' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"',
                'image_alt' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"',
                'description' => 'مؤسسة منبر الأقصى تطلق مشروعا استراتيجيا "عبادا لنا"'],
        ]);
    }
}
