<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Customer;

class CustomerSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {

        Customer::create(['image'=> 'default.png','rate'=>40, 'ar' => ['name' => 'Nour mohd','job' => 'زبون','comment' => 'الليزر عندهم أفضل من عيادات أخرى للأسف كنت عند عياده قبل سنه كامله ادفع على الفاضي ، و خلال ٦ جلسات متفرقه عند عياده سيوان فرق بشكل كبير عندي  جربوا الممرضة ديوا
تابعت مع د صهيب حمية غذائيه ونزلت بشكل سهل لأول مره بحياتي  بدون انتظام مني للأسف لو انتظمت كان نزلت اكتر 🙄كان جدا صبور ومتابع ومهتم.
جربت التقشير البارد وتنظيف البشرة اكتر من مره مع الاخصائية الاء وكان شغلها رائع 🤍 .

المواعيد عندهم سهله ومنتظمين فيها.
طاقم الاستقبال جدا بشوش وبنات الكول سنتر رائعات ومتفهمات وأشكر عبير على اهتمامها الدائم .
'], 'en' => ['name' => 'بهاء الحماد','job' => 'بروفسور','comment' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.']]);

        Customer::create(['image'=> 'default.png','rate'=>20, 'ar' => ['name' => 'لولي','job' => 'زبون','comment' => 'من اجمل العيادات الي زرتها
كانت تجربتي لايت للوجه
الطاقم جدا رائع ابتداء من الاخت عبير بالكول سنتر  تعاملها راقي وصدرها رحب وذوق وشرحها مفصل للخدمه المقدمه ومتعاونه جدا بالمواعيد تشيك من قلب وتتاكدلك من كل شي
والاخت امل بالاستقبال بشاشه وذوق التعامل
والنيرس شغلها تمام
التجربه بشكل عام جميله  وان شاء الله بتتكرر 🫶🏻
'], 'en' => ['name' => 'بهاء الحماد','job' => 'بروفسور','comment' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.']]);
        Customer::create(['image'=> 'default.png','rate'=>40, 'ar' => ['name' => 'غادة الحربي','job' => 'زبون','comment' => 'حابه أشكر الأخصائية/شيرين على شغلها الحلو والمميز ماشاءلله يدينها تتلف بحرير❤️انا كثير سويت هيدرافيشل لكن زي شغل شيرين الصراحه مالقيت رائعة رائعة رائعة بكل ماتعنيه الكلمة من معنى،اتكلم عن ايش والا ايش اخلاق و بشوشه واسلوبها جميل و شغلها مُتقن و نظيف واستقبلتني استقبال لطيف زيها 💕 ، كل الكلام ماراح يوفيكِ حقك ياشيرين لو فيه اكثر من الخمس نجوم كنت حطيتها ، وبإذن الله انا عميله دائمه عند شيرين العسل الله يوفقك ويسعدك تستاهلين كل خير ..
ً'], 'en' => ['name' => 'بهاء الحماد','job' => 'بروفسور','comment' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.']]);
        Customer::create(['image'=> 'default.png','rate'=>60, 'ar' => ['name' => 'مصعب العلي','job' => 'زبون','comment' => 'المركز من تدخلونه لما تطلعون ريحه النظافه طالعه منه
الاسقبال بشوشين و خدمتهم سريعه 🤩
سويت حواجبي عند شيرين عسل و شغلها حلوو و تسوي لك من قلب قلبها ف انصحكم فيها والله❤️❤️
راح اكرر الزياره طبعًا الايام الجايه ان شاءالله
'], 'en' => ['name' => 'Hessah Albarrak','job' => 'زبون','comment' => 'هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.']]);

    }
}
