<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\DoctorCategory;

class DoctorCategorySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DoctorCategory::create(['image'=>'doctor1.png',
            'ar' => ['name' => 'قسم الأسنان',
                'description' => '<h3 class="h3-xl blue-color">مجمع سوان لقسم الأسنان</h3>
<h4 class="h4-md blue-color">مفهوم الرعاية الصحية الوقائية للأسنان</h4>
<p class="p-lg">نعزز في مجمع سوان لقسم الأسنان مفهوم الرعاية الصحية الوقائية للأسنان، وذلك عبر تشجيع إجراء الفحوصات بشكل منتظم وتشجيع الالتزام بأساليب الحفاظ على صحة الفم والأسنان لبناء قوام صحي للأسنان واللثتين. نتميّز أيضاً بخبرتنا في طب الأسنان التجميلي ورسم الابتسامة على وجه المريض، إذ نهدف دائماً إلى تقديم أفضل رعاية صحية ممكنة له.</p>
<p class="p-lg"><img class="img-fluid" src="../../../storage/tiny_images/MI465GGExdSlVldBDkQU76zOKdMn679mGjPwJwyq.jpg" width="1080" height="1080" /></p>
<p class="p-lg">هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.<br class="line-break" />إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد،</p>
<p class="p-lg">النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.</p>
<p class="p-lg">&nbsp;</p>'],
            'en' => ['name' => 'قسم الأسنان',
                'description' => '<h3 class="h3-xl blue-color">مجمع سوان لقسم الأسنان</h3>
<h4 class="h4-md blue-color">مفهوم الرعاية الصحية الوقائية للأسنان</h4>
<p class="p-lg">نعزز في مجمع سوان لقسم الأسنان مفهوم الرعاية الصحية الوقائية للأسنان، وذلك عبر تشجيع إجراء الفحوصات بشكل منتظم وتشجيع الالتزام بأساليب الحفاظ على صحة الفم والأسنان لبناء قوام صحي للأسنان واللثتين. نتميّز أيضاً بخبرتنا في طب الأسنان التجميلي ورسم الابتسامة على وجه المريض، إذ نهدف دائماً إلى تقديم أفضل رعاية صحية ممكنة له.</p>
<p class="p-lg"><img src="../../../../storage/tiny_images/hDH2IWWEB8ThHbEow5b56ygrgHepUzCygdYsJy7G.jpg" /></p>
<p class="p-lg">هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق.<br class="line-break" />إذا كنت تحتاج إلى عدد أكبر من الفقرات يتيح لك مولد النص العربى زيادة عدد الفقرات كما تريد،</p>
<p class="p-lg">النص لن يبدو مقسما ولا يحوي أخطاء لغوية، مولد النص العربى مفيد لمصممي المواقع على وجه الخصوص، حيث يحتاج العميل فى كثير من الأحيان أن يطلع على صورة حقيقية لتصميم الموقع.</p>
<p class="p-lg">&nbsp;</p>'],
        ]);

        DoctorCategory::create(['image'=>'doctor2.png',
            'ar' => ['name' => 'جراحات التجميل',
                'description' => '<h3 class="h3-xl blue-color">مجمع سوان&nbsp;جراحات التجميل</h3>
<h4 class="h4-md blue-color">مفهوم الجراحات التجميل</h4>
<p class="p-lg">يُعرف عن هذا المركز خبرته المتميزة في الرعاية الصحية السريرية ومواكبته لأحدث التقنيات العلمية في هذا المجال. وتطغى على المركز أجواء دافئة وودية ويعتبر بيئة مثالية يتم التعامل فيها مع احتياجات كل مريض على حدة.</p>
<p class="p-lg"><img class="img-fluid" src="../../../storage/tiny_images/8cmOHsWX57scLdSEc3C7RNcnkCilu2N2EwjM7LTW.jpg" width="1080" height="1080" /></p>
<p class="p-lg">ويتلقّى المرضى العلاج على أيدي أبرز جراحي التجميل الذين يوظّفون أحدث ما توصل إليه العلم في مجال الجراحة التجميلية.</p>
<p class="p-lg">نؤمن في المركز بأهمية الاستماع إليك وخدمتك بجميع خبراتنا، كما نقدّم لك جميع الاستشارات المتعلقة بخياراتك العلاجية ونساعدك في اتخاذ القرار المناسب. إضافة لذلك، يتم تقديم جميع هذه الخدمات وأكثر في جميع الأوقات في جو من الأمان والسرية التامة.</p>
<p class="p-lg">&nbsp;</p>'],
            'en' => ['name' => 'قسم الجلدية والتجميل',
                'description' => 'جراحات التجميل'],
        ]);

        DoctorCategory::create(['image'=>'doctor3.png',
            'ar' => ['name' => 'الجلدية',
                'description' => '<h3 class="h3-xl blue-color">مجمع سوان قسم الجلدية</h3>
<h4 class="h4-md blue-color">مفهوم&nbsp;الجلدية</h4>
<p class="p-lg">يتميز مجمع سوان الطبي في قسم الجلدية في خبرته المتميزة في مجال العناية بالبشرة ومواكبته لأحدث التقنيات العلمية في هذا المجال.&nbsp;</p>
<p class="p-lg"><img class="img-fluid" src="../../../storage/tiny_images/h35tgkoSj0KYcQ0faH7opBWB0HTl5XcCdFbvzpfD.jpg" width="1080" height="1080" /></p>
<p class="p-lg">وتطغى عليه أجواء دافئة وودية ويعتبر بيئة مثالية يتم التعامل فيها مع احتياجات كل مريض على حدة.</p>
<p class="p-lg">سيجد المرضى أطباء وأخصائيين متمرسين في العناية بالبشرة والامراض الجلدية، وتتم معالجتهم بأحدث ما توصل إليه العلم في مجال العناية بالبشرة والامراض الجلدية والحقن التجميلية.</p>
<p class="p-lg">إضافة لذلك، يتم تقديم جميع هذه الخدمات وأكثر في جميع الأوقات وفي جو من الأمان والسرية التامة.</p>
<p class="p-lg">&nbsp;</p>'],
            'en' => ['name' => 'الجلدية',
                'description' => 'الجلدية'],
        ]);

        DoctorCategory::create(['image'=>'doctor4.png',
            'ar' => ['name' => 'الدايت واللايف ستايل',
                'description' => '<h3 class="h3-xl blue-color">مجمع سوان قسم الدايت واللايف ستايل</h3>
<h4 class="h4-md blue-color">مفهوم&nbsp;الدايت واللايف ستايل</h4>
<p class="p-lg">تعد التغذية السليمة من أهم عناصر الصحة الجيدة، حيث يقوم خبراء التغذية العلاجية الممارسين بتوجيهك لمعرفة الخيارات الغذائية التي تحسن صحتك وتعزز عافيتك، سواء عن طريق اختيار النظام الغذائي الأنسب لك أو عبر التحكم بالمرض والحالات المزمنة.&nbsp;</p>
<p class="p-lg"><img class="img-fluid" src="../../../storage/tiny_images/jozOmTMbidThPwlLcDzB2xkox3MGn4yf0lHhUfUr.jpg" width="1080" height="1080" /></p>
<p class="p-lg">يصمم أخصائي التغذية العلاجية برامج التغذية للوقاية من الأمراض وتخفيف أعراضها والسيطرة على الحساسية. في جلسات الاستشارة الغذائية:</p>
<p class="p-lg">يتم تقييم احتياجاتك الغذائية وتحديدها من قبل أخصائي التغذية، وذلك بناءً على حالتك الصحية،. كل ذلك بناءً على نتائج اختبارات نسبة الدهون وقياس كتلة الجسم باستخدام أحدث الأجهزة واتباع الطرق الطبية المعتمدة لتقييم الوضع الصحي. مع العلم أنه يتم التعامل مع المراجعين بشكل مستقل بما يناسب كل حالة فردية، وذلك بوصف خطة علاجية ذات برامج وأهداف محددة مناسبة لدعم الوضع الصحي للمريض. التغذية العلاجية مرتبطة بتحسين وتعزيز الصحة العامة، حيث تعتبر عاملاً مهماً في توفير الوقت والمال الذي يتم إنفاقه على الرعاية الطبية والأدوية لمرضى السكري وارتفاع ضغط الدم والسمنة والأمراض المزمنة الأخرى</p>
<p class="p-lg">&nbsp;</p>'],
            'en' => ['name' => 'الدايت واللايف ستايل',
                'description' => 'الدايت واللايف ستايل'],
        ]);

        DoctorCategory::create(['image'=>'doctor5.png',
            'ar' => ['name' => 'البشرة',
                'description' => '<h3 class="h3-xl blue-color">مجمع سوان قسم البشرة</h3>
<h4 class="h4-md blue-color">مفهوم&nbsp;البشرة</h4>
<p class="p-lg">البشرة النضرة والصحية هي غاية كل من يحب الجمال بشكل عام ، والأفضل هو ليس فقط الحصول على نضارة للبشرة بل استمرارية هذه النضارة للبشرة و الحفاظ على صحتها و اشراقها بشكل دائم</p>
<p class="p-lg"><img class="img-fluid" src="../../../storage/tiny_images/U37vJRJe14GXXtmR1WhcMSDwut3dE8vgjfetLwxO.jpg" width="1080" height="1080" /></p>
<p class="p-lg">لذلك الاهتمام المستمر مهم جدا بالإضافة الى جلسات النتظيف على اختلاف أنواع بما يتناسب مع نوع كل بشرة على حدا ، وهذا كان هدفنا عند انشاء قسم العناية بالبشرة ، ان يجد الأنسب لبشرة مهما كان نوعها و ماتحتاجه لاستعادة نضارتها او الحفاظ عليها</p>

'],
            'en' => ['name' => 'البشرة',
                'description' => 'البشرة'],
        ]);
    }
}
