<?php

namespace Database\Seeders;

use App\Models\PageCategory;
use App\Models\Page;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class PageSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        // policy & terms
        Page::create(['page_category_id'=>null,
            'header_show' => null,
            'special' => null,
            'locked' => 1,
            'ar' => ['name' => 'سياسة الخصوصية', 'description' => '<p style="text-align: justify;">يرحب بكم فريق عمل براند اكس ويقدم لكم الشكر لإمضاء القليل من الوقت لقراءة سياسة الخصوصية الخاصة بالمنصة.</p>
<p style="text-align: justify;">نقدر مخاوفكم واهتمامكم بشأن خصوصية بياناتكم على شبكة الإنترنت، ولذلك تم إعداد هذه السياسة لمساعدتكم في تفهم طبيعة البيانات التي نقوم بتجميعها منكم عند زيارتكم لموقعنا على شبكة الإنترنت وكيفية تعاملنا مع هذه البيانات الشخصية.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>أولاً، التصفح:</strong></span></h3>
<p style="text-align: justify;">لم نقم بتصميم هذا الموقع من أجل تجميع بياناتك الشخصية من جهاز الكمبيوتر الخاص بك أثناء تصفحك لهذا الموقع، وإنما سيتم فقط استخدام البيانات المقدمة من قبلك بمعرفتك ومحض إرادتك.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>ثانياً، عنوان بروتوكول شبكة الإنترنت (IP):</strong></span></h3>
<p style="text-align: justify;">في أي وقت تزور فيه موقع إنترنت بما فيها هذا الموقع، سيقوم السيرفر المضيف بتسجيل عنوان بروتوكول شبكة الإنترنت (IP) الخاص بك، وتاريخ ووقت الزيارة، ونوع متصفح الإنترنت الذي تستخدمه، وعنوان&nbsp;URL الخاص بأي موقع من مواقع الإنترنت التي تقوم بإحالتك إلى الى هذا الموقع على الشبكة.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>ثالثاً، عمليات المسح على الشبكة:</strong></span></h3>
<p style="text-align: justify;">إن عمليات المسح التي نقوم بها مباشرة على الشبكة تمكننا من تجميع بيانات محددة مثل البيانات المطلوبة منك بخصوص نظرتك وشعورك تجاه موقعنا، وتعتبر ردودك ذات أهمية كبيرة بالنسبة لنا، وهي ومحل تقديرنا حيث أنها تمكننا من تحسين مستوى موقعنا، ولك كامل الحرية والاختيار في تقديم البيانات المتعلقة باسمك والبيانات الأخرى.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>رابعاً، الروابط بالمواقع الأخرى على شبكة الإنترنت:</strong></span></h3>
<p style="text-align: justify;">قد يشتمل موقعنا على روابط بالمواقع الأخرى على شبكة الإنترنت، او علانات من مواقع أُخرى مثل&nbsp;<a href="https://www.google.com/adsense"><span style="color: hsl(210,75%,60%);"><u>Google AdSense</u></span> </a>ولا نعتبر مسئولين عن أساليب تجميع البيانات من قبل تلك المواقع، ويمكنك الاطلاع على سياسات السرية والمحتويات الخاصة بتلك المواقع التي يتم الدخول إليها من خلال موقعهم الرسمي.</p>
<p style="text-align: justify;">نحن قد نستعين بشركات إعلان لأطراف ثالثة لعرض الإعلانات عندما تزور موقعنا على الويب. يحق لهذه الشركات أن تستخدم معلومات حول زياراتك لهذا الموقع ولمواقع الويب الأخرى (باستثناء الاسم أو العنوان أو عنوان البريد الإلكتروني أو رقم الهاتف)، وذلك من أجل تقديم إعلانات حول البضائع والخدمات التي تهمك، وإذا كنت ترغب في مزيد من المعلومات حول هذا الأمر وكذلك إذا كنت تريد معرفة الاختيارات المتاحة لك لمنع استخدام هذه المعلومات من قِبل هذه الشركات،<a href="https://policies.google.com/technologies/ads"> <span style="color: hsl(210,75%,60%);"><u>فالرجاء النقر هنا</u></span></a>.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>خامساً، إفشاء المعلومات:</strong></span></h3>
<p style="text-align: justify;">سنحافظ في كافة الأوقات على خصوصية وسرية كافة البيانات الشخصية التي نتحصل عليها، ولن يتم إفشاء هذه المعلومات إلا إذا كان ذلك مطلوباً بموجب أي قانون أو عندما نعتقد بحسن نية أن مثل هذا الإجراء سيكون مطلوباً أو مرغوباً فيه للتمشي مع القانون، أو للدفاع عن أو حماية حقوق الملكية الخاصة بهذا الموقع أو الجهات المستفيدة منه.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>سادساً، البيانات اللازمة لتنفيذ المعاملات المطلوبة من قبلك:</strong></span></h3>
<p style="text-align: justify;">عندما نحتاج إلى أية بيانات خاصة بك، فإننا سنطلب منك تقديمها بمحض إرادتك. حيث ستساعدنا هذه المعلومات في الاتصال بك وتنفيذ طلباتك حيثما كان ذلك ممكنناً. لن يتم إطلاقاً بيع البيانات المقدمة من قبلك إلى أي طرف ثالث بغرض تسويقها لمصلحته الخاصة دون الحصول على موافقتك المسبقة والمكتوبة ما لم يتم ذلك على أساس أنها ضمن بيانات جماعية تستخدم للأغراض الإحصائية والأبحاث دون اشتمالها على أية بيانات من الممكن استخدامها للتعريف بك.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>سابعاً، عند الاتصال بنا:</strong></span></h3>
<p style="text-align: justify;">سيتم التعامل مع كافة البيانات المقدمة من قبلك على أساس أنها سرية. تتطلب النماذج التي يتم تقديمها مباشرة على الشبكة تقديم البيانات التي ستساعدنا في تحسين موقعنا، وسيتم استخدام البيانات التي يتم تقديمها من قبلك في الرد على كافة استفساراتك، وملاحظاتك، أو طلباتك من قبل هذا الموقع أو أياً من المواقع التابعة له.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>ثامناً، إفشاء المعلومات لأي طرف ثالث:</strong></span></h3>
<p style="text-align: justify;">لن نقوم ببيع، أو المتاجرة، أو إفشاء أية معلومات لمصلحة أي طرف ثالث خارج هذا الموقع، أو المواقع التابعة له، ووسيتم الكشف عن المعلومات فقط في حالة صدور أمر بذلك من قبل أي سلطة قضائية أو تنظيمية.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>تاسعاً، التعديلات على سياسة السرية وخصوصية المعلومات:</strong></span></h3>
<p style="text-align: justify;">نحتفظ بالحق في تعديل بنود وشروط سياسة السرية وخصوصية المعلومات إن لزم الأمر ومتى كان ذلك ملائماً، وسيتم تنفيذ التعديلات هنا او على صفحة سياسة الخصوصية الرئيسية وسيتم بصفة مستمرة إخطارك بالبيانات التي حصلنا عليها، وكيف سنستخدمها والجهة التي سنقوم بتزويدها بهذه البيانات.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>عاشراً، حذف الحساب:</strong></span></h3>
<section id="about-us-page">
<div>
<div>
<div>
<div>
<p style="text-align: right;">في حال قمت بتسجيل الدخول إلى الموقع باستخدام معلوماتك الشخصية، يمكنك حذف الحساب في أيّ وقت تشاء وذلك من خلال الضغط على أيقونة حذف الحساب في صفحة تعديل بياناتي الشخصية.</p>
</div>
</div>
</div>
</div>
</section>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>أخيراً</strong></span></h3>
<p style="text-align: justify;">يمكنكم الاتصال بنا عند الحاجة من خلال الضغط على رابط اتصل بنا المتوفر في روابط موقعنا او الإرسال الى بريدنا الإلكتروني info@tazkiya.com.</p>
<p style="text-align: justify;">إن مخاوفك واهتمامك بشأن سرية وخصوصية البيانات تعتبر مسألة في غاية الأهمية بالنسبة لنا. نحن نأمل أن يتم تحقيق ذلك من خلال هذه السياسة.</p>'], 'en' => ['name' => 'سياسة الخصوصية', 'description' => '<p style="text-align: justify;">يرحب بكم فريق عمل براند اكس ويقدم لكم الشكر لإمضاء القليل من الوقت لقراءة سياسة الخصوصية الخاصة بالمنصة.</p>
<p style="text-align: justify;">نقدر مخاوفكم واهتمامكم بشأن خصوصية بياناتكم على شبكة الإنترنت، ولذلك تم إعداد هذه السياسة لمساعدتكم في تفهم طبيعة البيانات التي نقوم بتجميعها منكم عند زيارتكم لموقعنا على شبكة الإنترنت وكيفية تعاملنا مع هذه البيانات الشخصية.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>أولاً، التصفح:</strong></span></h3>
<p style="text-align: justify;">لم نقم بتصميم هذا الموقع من أجل تجميع بياناتك الشخصية من جهاز الكمبيوتر الخاص بك أثناء تصفحك لهذا الموقع، وإنما سيتم فقط استخدام البيانات المقدمة من قبلك بمعرفتك ومحض إرادتك.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>ثانياً، عنوان بروتوكول شبكة الإنترنت (IP):</strong></span></h3>
<p style="text-align: justify;">في أي وقت تزور فيه موقع إنترنت بما فيها هذا الموقع، سيقوم السيرفر المضيف بتسجيل عنوان بروتوكول شبكة الإنترنت (IP) الخاص بك، وتاريخ ووقت الزيارة، ونوع متصفح الإنترنت الذي تستخدمه، وعنوان&nbsp;URL الخاص بأي موقع من مواقع الإنترنت التي تقوم بإحالتك إلى الى هذا الموقع على الشبكة.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>ثالثاً، عمليات المسح على الشبكة:</strong></span></h3>
<p style="text-align: justify;">إن عمليات المسح التي نقوم بها مباشرة على الشبكة تمكننا من تجميع بيانات محددة مثل البيانات المطلوبة منك بخصوص نظرتك وشعورك تجاه موقعنا، وتعتبر ردودك ذات أهمية كبيرة بالنسبة لنا، وهي ومحل تقديرنا حيث أنها تمكننا من تحسين مستوى موقعنا، ولك كامل الحرية والاختيار في تقديم البيانات المتعلقة باسمك والبيانات الأخرى.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>رابعاً، الروابط بالمواقع الأخرى على شبكة الإنترنت:</strong></span></h3>
<p style="text-align: justify;">قد يشتمل موقعنا على روابط بالمواقع الأخرى على شبكة الإنترنت، او علانات من مواقع أُخرى مثل&nbsp;<a href="https://www.google.com/adsense"><span style="color: hsl(210,75%,60%);"><u>Google AdSense</u></span> </a>ولا نعتبر مسئولين عن أساليب تجميع البيانات من قبل تلك المواقع، ويمكنك الاطلاع على سياسات السرية والمحتويات الخاصة بتلك المواقع التي يتم الدخول إليها من خلال موقعهم الرسمي.</p>
<p style="text-align: justify;">نحن قد نستعين بشركات إعلان لأطراف ثالثة لعرض الإعلانات عندما تزور موقعنا على الويب. يحق لهذه الشركات أن تستخدم معلومات حول زياراتك لهذا الموقع ولمواقع الويب الأخرى (باستثناء الاسم أو العنوان أو عنوان البريد الإلكتروني أو رقم الهاتف)، وذلك من أجل تقديم إعلانات حول البضائع والخدمات التي تهمك، وإذا كنت ترغب في مزيد من المعلومات حول هذا الأمر وكذلك إذا كنت تريد معرفة الاختيارات المتاحة لك لمنع استخدام هذه المعلومات من قِبل هذه الشركات،<a href="https://policies.google.com/technologies/ads"> <span style="color: hsl(210,75%,60%);"><u>فالرجاء النقر هنا</u></span></a>.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>خامساً، إفشاء المعلومات:</strong></span></h3>
<p style="text-align: justify;">سنحافظ في كافة الأوقات على خصوصية وسرية كافة البيانات الشخصية التي نتحصل عليها، ولن يتم إفشاء هذه المعلومات إلا إذا كان ذلك مطلوباً بموجب أي قانون أو عندما نعتقد بحسن نية أن مثل هذا الإجراء سيكون مطلوباً أو مرغوباً فيه للتمشي مع القانون، أو للدفاع عن أو حماية حقوق الملكية الخاصة بهذا الموقع أو الجهات المستفيدة منه.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>سادساً، البيانات اللازمة لتنفيذ المعاملات المطلوبة من قبلك:</strong></span></h3>
<p style="text-align: justify;">عندما نحتاج إلى أية بيانات خاصة بك، فإننا سنطلب منك تقديمها بمحض إرادتك. حيث ستساعدنا هذه المعلومات في الاتصال بك وتنفيذ طلباتك حيثما كان ذلك ممكنناً. لن يتم إطلاقاً بيع البيانات المقدمة من قبلك إلى أي طرف ثالث بغرض تسويقها لمصلحته الخاصة دون الحصول على موافقتك المسبقة والمكتوبة ما لم يتم ذلك على أساس أنها ضمن بيانات جماعية تستخدم للأغراض الإحصائية والأبحاث دون اشتمالها على أية بيانات من الممكن استخدامها للتعريف بك.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>سابعاً، عند الاتصال بنا:</strong></span></h3>
<p style="text-align: justify;">سيتم التعامل مع كافة البيانات المقدمة من قبلك على أساس أنها سرية. تتطلب النماذج التي يتم تقديمها مباشرة على الشبكة تقديم البيانات التي ستساعدنا في تحسين موقعنا، وسيتم استخدام البيانات التي يتم تقديمها من قبلك في الرد على كافة استفساراتك، وملاحظاتك، أو طلباتك من قبل هذا الموقع أو أياً من المواقع التابعة له.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>ثامناً، إفشاء المعلومات لأي طرف ثالث:</strong></span></h3>
<p style="text-align: justify;">لن نقوم ببيع، أو المتاجرة، أو إفشاء أية معلومات لمصلحة أي طرف ثالث خارج هذا الموقع، أو المواقع التابعة له، ووسيتم الكشف عن المعلومات فقط في حالة صدور أمر بذلك من قبل أي سلطة قضائية أو تنظيمية.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>تاسعاً، التعديلات على سياسة السرية وخصوصية المعلومات:</strong></span></h3>
<p style="text-align: justify;">نحتفظ بالحق في تعديل بنود وشروط سياسة السرية وخصوصية المعلومات إن لزم الأمر ومتى كان ذلك ملائماً، وسيتم تنفيذ التعديلات هنا او على صفحة سياسة الخصوصية الرئيسية وسيتم بصفة مستمرة إخطارك بالبيانات التي حصلنا عليها، وكيف سنستخدمها والجهة التي سنقوم بتزويدها بهذه البيانات.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>عاشراً، حذف الحساب:</strong></span></h3>
<section id="about-us-page">
<div>
<div>
<div>
<div>
<p style="text-align: right;">في حال قمت بتسجيل الدخول إلى الموقع باستخدام معلوماتك الشخصية، يمكنك حذف الحساب في أيّ وقت تشاء وذلك من خلال الضغط على أيقونة حذف الحساب في صفحة تعديل بياناتي الشخصية.</p>
</div>
</div>
</div>
</div>
</section>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>أخيراً</strong></span></h3>
<p style="text-align: justify;">يمكنكم الاتصال بنا عند الحاجة من خلال الضغط على رابط اتصل بنا المتوفر في روابط موقعنا او الإرسال الى بريدنا الإلكتروني info@tazkiya.com.</p>
<p style="text-align: justify;">إن مخاوفك واهتمامك بشأن سرية وخصوصية البيانات تعتبر مسألة في غاية الأهمية بالنسبة لنا. نحن نأمل أن يتم تحقيق ذلك من خلال هذه السياسة.</p>']]);
        Page::create(['page_category_id'=>null,
            'header_show' => null,
            'special' => null,
            'locked' => 1,
            'ar' => ['name' => 'شروط الإستخدام', 'description' => '<p style="text-align: justify;">يرجى قراءة "شروط الاستخدام" هذه بعناية قبل استخدام موقعنا.</p>
<p style="text-align: justify;">يعتبر عملاؤنا الذين يستخدمون موقعنا هذا قد وافقوا على الشروط التالية:</p>
<p style="text-align: justify;">إن صفحات الويب على موقعنا وجميع الصفحات المرتبطة به مملوكة ومدارة من قبل براند اكس</p>
<p style="text-align: justify;">أثناء استخدامك ("كمستخدم") لجميع الخدمات المقدمة على الموقع، فإنك تخضع للشروط التالية، أثناء استخدام هذه الخدمة والاستمرار في استخدامها على الموقع، ويُعتبر أنك قد قبلت أن لديك الحق والسلطة والأهلية القانونية لتوقيع عقد وفقاً للقوانين التي تلتزم بها، وأنك تجاوزت 18 عاماً، وأنك قرأت وفهمت هذا العقد وأنك ملزم بالشروط المكتوبة في العقد.</p>
<p style="text-align: justify;">يفرض هذا العقد حقوقاً والتزامات على الموقع المتعاقد عليه للطرفين ويعلن الطرفان أنهما سيفعلان الحقوق والالتزامات المذكورة بشكل كامل وصحيح وفي الوقت المناسب، ضمن الشروط المطلوبة في هذا العقد عند قبولهم لهذا العقد.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 1- &nbsp;المسؤوليات:</strong></span></h3>
<ol style="list-style-type: lower-alpha;">
<li style="text-align: justify;">تحتفظ الشركة دائماً بالحق في إجراء تغييرات على الأسعار والمنتجات والخدمات المعروضة.</li>
<li style="text-align: justify;">تقبل الشركة وتتعهد بأن يستفيد العضو من الخدمات الخاضعة للعقد بخلاف الأعطال الفنية.</li>
<li style="text-align: justify;">يوافق المستخدم مقدماً على عدم إجراء هندسة عكسية لاستخدام الموقع أو اتخاذ أي إجراء آخر للعثور على الكود المصدري أو الحصول عليه، وإلا فسيكون مسؤولاً عن الأضرار التي تلحق بأطراف ثالثة، وسيتم اتخاذ الإجراءات القانونية والجنائية.</li>
<li style="text-align: justify;">يكون المستخدم في أنشطته داخل الموقع، في أي جزء من الموقع أو في اتصالاته، مخالفاً للأخلاق العامة والقانون، ينتهك حقوق الغير، مضلل، عدواني، فاحش، إباحي، يضر بالحقوق الشخصية، ينتهك حقوق النشر، يروج لأنشطة غير قانونية يوافق على أنه لن ينتج أو يشارك المحتوى. بخلاف ذلك، فهو مسؤول مسؤولية كاملة عن الضرر الذي قد يحدث، وفي هذه الحالة تحتفظ سلطات "الموقع" بالحق في تعليق هذه الحسابات وإنهائها وبدء الإجراءات القانونية. لهذا السبب، فإنها تحتفظ بالحق في مشاركة طلبات المعلومات من السلطات القضائية فيما يتعلق بالنشاط أو حسابات المستخدمين.</li>
<li style="text-align: justify;">أعضاء الموقع مسؤولون عن علاقاتهم مع بعضهم البعض أو مع أطراف ثالثة.</li>
</ol>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 2- &nbsp;حقوق الملكية الفكرية:</strong></span></h3>
<ol style="list-style-type: lower-alpha;">
<li style="text-align: justify;">جميع حقوق الملكية الفكرية أو حقوق الملكية الفكرية غير المسجلة مثل الملكية والاسم التجاري والعلامة التجارية وبراءات الاختراع والشعار والتصميم والمعلومات والطريقة الموجودة على هذا الموقع مملوكة لمشغل الموقع وشركة مالكه أو الشخص المعني وتخضع لحماية القانون الوطني والدولي. زيارة هذا الموقع أو استخدام الخدمات الموجودة عليه لا يعطي أي حقوق لحقوق الملكية الفكرية المعنية.</li>
<li style="text-align: justify;">لا يمكن إعادة إنتاج المعلومات الموجودة على الموقع أو نشرها أو نسخها أو تقديمها و / أو نقلها بأي شكل من الأشكال. لا يمكن استخدام الموقع بالكامل أو جزء منه على موقع ويب آخر دون إذن.</li>
</ol>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 3- &nbsp;المعلومات السرية:</strong></span></h3>
<ol style="list-style-type: lower-alpha;">
<li style="text-align: justify;">لن تقوم الشركة بالإفصاح عن المعلومات الشخصية التي يرسلها المستخدمون عبر الموقع إلى أطراف ثالثة. هذه المعلومات الشخصية، تتضمن جميع أنواع المعلومات الأخرى لتحديد هوية المستخدم مثل اسم الشخص واللقب والعنوان ورقم الهاتف والهاتف المحمول وعنوان البريد الإلكتروني، وسيشار إليه بإيجاز باسم "المعلومات السرية".</li>
<li style="text-align: justify;">يمكن للمستخدم فقط استخدام الترويج والإعلان وما إلى ذلك. تقبل وتعلن أن الشركة التي تمتلك الموقع توافق على مشاركة اتصالاتها وحالة محفظتها ومعلوماتها الديموغرافية مع شركاتها الفرعية أو شركات المجموعة التابعة لها، على أن يقتصر استخدامها في نطاق الأنشطة التسويقية. يمكن استخدام هذه المعلومات الشخصية لتحديد ملف تعريف العميل داخل الشركة، لتقديم العروض الترويجية والحملات المناسبة لملف تعريف العميل وإجراء الدراسات الإحصائية.</li>
<li style="text-align: justify;">لا يجوز الكشف عن المعلومات السرية للسلطات العامة إلا في الحالات التي تطلب فيها هذه المعلومات من قبل السلطات الرسمية وعندما يكون الكشف عنها مطلوباً وفقاً لأحكام التشريعات الإلزامية المعمول بها.</li>
</ol>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 4- &nbsp;لا يوجد ضمان:</strong></span></h3>
<p style="text-align: justify;">يجب أن يكون بند الاتفاقية هذا سارياً إلى الحد الأقصى الذي يسمح به القانون المعمول به. يتم توفير الخدمات التي تقدمها الشركة "كما هي" و "كما هي متوفرة" وهي جميعاً ضمانات ضمنية، بما في ذلك أي ضمانات ضمنية لعدم الانتهاك. لا توجد ضمانات من أي نوع أو نظام أو غير ذلك.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 5- &nbsp;التسجيل والأمن:</strong></span></h3>
<p style="text-align: justify;">يجب على المستخدم تقديم معلومات تسجيل صحيحة وكاملة وحديثة. خلاف ذلك، سيتم اعتبار هذه الاتفاقية منتهكة ويمكن إغلاق الحساب دون إبلاغ المستخدم.</p>
<p style="text-align: justify;">المستخدم مسؤول عن أمان كلمة المرور والحساب على الموقع ومواقع الطرف الثالث. خلاف ذلك، لا يمكن تحميل الشركة مسؤولية فقدان البيانات وانتهاكات الأمان أو تلف الأجهزة.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 6- &nbsp;أسباب مجبرة:</strong></span></h3>
<p style="text-align: justify;">أسباب مثل عدم الخضوع لسيطرة الأطراف، الكوارث الطبيعية، والحرائق، والانفجارات، والحروب الأهلية، والحروب، وأعمال الشغب، والتحركات الشعبية، وإعلان التعبئة، والإضرابات، والإغلاق والأوبئة، وانقطاع البنية التحتية والإنترنت، وانقطاع التيار الكهربائي... كلها يتم الإشارة إليها باسم "أسباب مجبرة". إذا أصبحت الالتزامات غير مقبولة من قبل الأطراف، فإن الأطراف ليست مسؤولة عنها. خلال هذه الفترة، يتم تعليق حقوق والتزامات الأطراف الناشئة عن هذه الاتفاقية.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 7- &nbsp;سلامة العقد وقابلية التطبيق:</strong></span></h3>
<p style="text-align: justify;">إذا أصبح أحد شروط هذا العقد غير صالح جزئياً أو كلياً، يظل باقي العقد سارياً.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 8- &nbsp;تعديلات العقد:</strong></span></h3>
<p style="text-align: justify;">يجوز للشركة تغيير الخدمات المقدمة على الموقع وشروط هذا العقد في أي وقت، كلياً أو جزئياً. ستكون التغييرات سارية المفعول من تاريخ نشرها على الموقع. تقع على عاتق المستخدم مسؤولية متابعة التغييرات، ويعتبر المستخدم قد قبل هذه التغييرات من خلال الاستمرار في الاستفادة من الخدمات المقدمة.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 9- &nbsp;الإشعار:</strong></span></h3>
<p style="text-align: justify;">سيتم إرسال جميع الإشعارات إلى الأطراف ذات الصلة بهذه الاتفاقية من خلال عنوان البريد الإلكتروني المعروف للشركة وعنوان البريد الإلكتروني المحدد في نموذج عضوية المستخدم.</p>
<p style="text-align: justify;">يوافق المستخدم على أن العنوان الذي حدده عندما أصبح عضواً هو عنوان الإشعار الصحيح، وأنه سيبلغ الطرف الآخر كتابياً في غضون 5 أيام إذا تغير، وإلا فإن الإشعارات التي سيتم إرسالها إلى هذا العنوان ستعتبر صالحة.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 10- &nbsp;اتفاق الإثبات:</strong></span></h3>
<p style="text-align: justify;">في جميع الخلافات التي قد تنشأ بين الأطراف بشأن المعاملات المتعلقة بهذا العقد، سيتم قبول دفاتر الأطراف وسجلاتهم ووثائقهم وسجلات الكمبيوتر وسجلات الفاكس كدليل وفقاً لقانون الإجراءات المدنية رقم 6100، ويوافق المستخدم على عدم الاعتراض على هذه السجلات.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 11- &nbsp;تسوية الخلافات:</strong></span></h3>
<p style="text-align: justify;">يُسمح لمحاكم ومكاتب التنفيذ بإسطنبول (المركزية) بحل أي خلاف ينشأ عن تنفيذ أو تفسير هذه الاتفاقية.</p>'], 'en' => ['name' => 'شروط الإستخدام', 'description' => '<p style="text-align: justify;">يرجى قراءة "شروط الاستخدام" هذه بعناية قبل استخدام موقعنا.</p>
<p style="text-align: justify;">يعتبر عملاؤنا الذين يستخدمون موقعنا هذا قد وافقوا على الشروط التالية:</p>
<p style="text-align: justify;">إن صفحات الويب على موقعنا وجميع الصفحات المرتبطة به مملوكة ومدارة من قبل براند اكس</p>
<p style="text-align: justify;">أثناء استخدامك ("كمستخدم") لجميع الخدمات المقدمة على الموقع، فإنك تخضع للشروط التالية، أثناء استخدام هذه الخدمة والاستمرار في استخدامها على الموقع، ويُعتبر أنك قد قبلت أن لديك الحق والسلطة والأهلية القانونية لتوقيع عقد وفقاً للقوانين التي تلتزم بها، وأنك تجاوزت 18 عاماً، وأنك قرأت وفهمت هذا العقد وأنك ملزم بالشروط المكتوبة في العقد.</p>
<p style="text-align: justify;">يفرض هذا العقد حقوقاً والتزامات على الموقع المتعاقد عليه للطرفين ويعلن الطرفان أنهما سيفعلان الحقوق والالتزامات المذكورة بشكل كامل وصحيح وفي الوقت المناسب، ضمن الشروط المطلوبة في هذا العقد عند قبولهم لهذا العقد.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 1- &nbsp;المسؤوليات:</strong></span></h3>
<ol style="list-style-type: lower-alpha;">
<li style="text-align: justify;">تحتفظ الشركة دائماً بالحق في إجراء تغييرات على الأسعار والمنتجات والخدمات المعروضة.</li>
<li style="text-align: justify;">تقبل الشركة وتتعهد بأن يستفيد العضو من الخدمات الخاضعة للعقد بخلاف الأعطال الفنية.</li>
<li style="text-align: justify;">يوافق المستخدم مقدماً على عدم إجراء هندسة عكسية لاستخدام الموقع أو اتخاذ أي إجراء آخر للعثور على الكود المصدري أو الحصول عليه، وإلا فسيكون مسؤولاً عن الأضرار التي تلحق بأطراف ثالثة، وسيتم اتخاذ الإجراءات القانونية والجنائية.</li>
<li style="text-align: justify;">يكون المستخدم في أنشطته داخل الموقع، في أي جزء من الموقع أو في اتصالاته، مخالفاً للأخلاق العامة والقانون، ينتهك حقوق الغير، مضلل، عدواني، فاحش، إباحي، يضر بالحقوق الشخصية، ينتهك حقوق النشر، يروج لأنشطة غير قانونية يوافق على أنه لن ينتج أو يشارك المحتوى. بخلاف ذلك، فهو مسؤول مسؤولية كاملة عن الضرر الذي قد يحدث، وفي هذه الحالة تحتفظ سلطات "الموقع" بالحق في تعليق هذه الحسابات وإنهائها وبدء الإجراءات القانونية. لهذا السبب، فإنها تحتفظ بالحق في مشاركة طلبات المعلومات من السلطات القضائية فيما يتعلق بالنشاط أو حسابات المستخدمين.</li>
<li style="text-align: justify;">أعضاء الموقع مسؤولون عن علاقاتهم مع بعضهم البعض أو مع أطراف ثالثة.</li>
</ol>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 2- &nbsp;حقوق الملكية الفكرية:</strong></span></h3>
<ol style="list-style-type: lower-alpha;">
<li style="text-align: justify;">جميع حقوق الملكية الفكرية أو حقوق الملكية الفكرية غير المسجلة مثل الملكية والاسم التجاري والعلامة التجارية وبراءات الاختراع والشعار والتصميم والمعلومات والطريقة الموجودة على هذا الموقع مملوكة لمشغل الموقع وشركة مالكه أو الشخص المعني وتخضع لحماية القانون الوطني والدولي. زيارة هذا الموقع أو استخدام الخدمات الموجودة عليه لا يعطي أي حقوق لحقوق الملكية الفكرية المعنية.</li>
<li style="text-align: justify;">لا يمكن إعادة إنتاج المعلومات الموجودة على الموقع أو نشرها أو نسخها أو تقديمها و / أو نقلها بأي شكل من الأشكال. لا يمكن استخدام الموقع بالكامل أو جزء منه على موقع ويب آخر دون إذن.</li>
</ol>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 3- &nbsp;المعلومات السرية:</strong></span></h3>
<ol style="list-style-type: lower-alpha;">
<li style="text-align: justify;">لن تقوم الشركة بالإفصاح عن المعلومات الشخصية التي يرسلها المستخدمون عبر الموقع إلى أطراف ثالثة. هذه المعلومات الشخصية، تتضمن جميع أنواع المعلومات الأخرى لتحديد هوية المستخدم مثل اسم الشخص واللقب والعنوان ورقم الهاتف والهاتف المحمول وعنوان البريد الإلكتروني، وسيشار إليه بإيجاز باسم "المعلومات السرية".</li>
<li style="text-align: justify;">يمكن للمستخدم فقط استخدام الترويج والإعلان وما إلى ذلك. تقبل وتعلن أن الشركة التي تمتلك الموقع توافق على مشاركة اتصالاتها وحالة محفظتها ومعلوماتها الديموغرافية مع شركاتها الفرعية أو شركات المجموعة التابعة لها، على أن يقتصر استخدامها في نطاق الأنشطة التسويقية. يمكن استخدام هذه المعلومات الشخصية لتحديد ملف تعريف العميل داخل الشركة، لتقديم العروض الترويجية والحملات المناسبة لملف تعريف العميل وإجراء الدراسات الإحصائية.</li>
<li style="text-align: justify;">لا يجوز الكشف عن المعلومات السرية للسلطات العامة إلا في الحالات التي تطلب فيها هذه المعلومات من قبل السلطات الرسمية وعندما يكون الكشف عنها مطلوباً وفقاً لأحكام التشريعات الإلزامية المعمول بها.</li>
</ol>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 4- &nbsp;لا يوجد ضمان:</strong></span></h3>
<p style="text-align: justify;">يجب أن يكون بند الاتفاقية هذا سارياً إلى الحد الأقصى الذي يسمح به القانون المعمول به. يتم توفير الخدمات التي تقدمها الشركة "كما هي" و "كما هي متوفرة" وهي جميعاً ضمانات ضمنية، بما في ذلك أي ضمانات ضمنية لعدم الانتهاك. لا توجد ضمانات من أي نوع أو نظام أو غير ذلك.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 5- &nbsp;التسجيل والأمن:</strong></span></h3>
<p style="text-align: justify;">يجب على المستخدم تقديم معلومات تسجيل صحيحة وكاملة وحديثة. خلاف ذلك، سيتم اعتبار هذه الاتفاقية منتهكة ويمكن إغلاق الحساب دون إبلاغ المستخدم.</p>
<p style="text-align: justify;">المستخدم مسؤول عن أمان كلمة المرور والحساب على الموقع ومواقع الطرف الثالث. خلاف ذلك، لا يمكن تحميل الشركة مسؤولية فقدان البيانات وانتهاكات الأمان أو تلف الأجهزة.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 6- &nbsp;أسباب مجبرة:</strong></span></h3>
<p style="text-align: justify;">أسباب مثل عدم الخضوع لسيطرة الأطراف، الكوارث الطبيعية، والحرائق، والانفجارات، والحروب الأهلية، والحروب، وأعمال الشغب، والتحركات الشعبية، وإعلان التعبئة، والإضرابات، والإغلاق والأوبئة، وانقطاع البنية التحتية والإنترنت، وانقطاع التيار الكهربائي... كلها يتم الإشارة إليها باسم "أسباب مجبرة". إذا أصبحت الالتزامات غير مقبولة من قبل الأطراف، فإن الأطراف ليست مسؤولة عنها. خلال هذه الفترة، يتم تعليق حقوق والتزامات الأطراف الناشئة عن هذه الاتفاقية.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 7- &nbsp;سلامة العقد وقابلية التطبيق:</strong></span></h3>
<p style="text-align: justify;">إذا أصبح أحد شروط هذا العقد غير صالح جزئياً أو كلياً، يظل باقي العقد سارياً.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 8- &nbsp;تعديلات العقد:</strong></span></h3>
<p style="text-align: justify;">يجوز للشركة تغيير الخدمات المقدمة على الموقع وشروط هذا العقد في أي وقت، كلياً أو جزئياً. ستكون التغييرات سارية المفعول من تاريخ نشرها على الموقع. تقع على عاتق المستخدم مسؤولية متابعة التغييرات، ويعتبر المستخدم قد قبل هذه التغييرات من خلال الاستمرار في الاستفادة من الخدمات المقدمة.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 9- &nbsp;الإشعار:</strong></span></h3>
<p style="text-align: justify;">سيتم إرسال جميع الإشعارات إلى الأطراف ذات الصلة بهذه الاتفاقية من خلال عنوان البريد الإلكتروني المعروف للشركة وعنوان البريد الإلكتروني المحدد في نموذج عضوية المستخدم.</p>
<p style="text-align: justify;">يوافق المستخدم على أن العنوان الذي حدده عندما أصبح عضواً هو عنوان الإشعار الصحيح، وأنه سيبلغ الطرف الآخر كتابياً في غضون 5 أيام إذا تغير، وإلا فإن الإشعارات التي سيتم إرسالها إلى هذا العنوان ستعتبر صالحة.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 10- &nbsp;اتفاق الإثبات:</strong></span></h3>
<p style="text-align: justify;">في جميع الخلافات التي قد تنشأ بين الأطراف بشأن المعاملات المتعلقة بهذا العقد، سيتم قبول دفاتر الأطراف وسجلاتهم ووثائقهم وسجلات الكمبيوتر وسجلات الفاكس كدليل وفقاً لقانون الإجراءات المدنية رقم 6100، ويوافق المستخدم على عدم الاعتراض على هذه السجلات.</p>
<h3 style="text-align: justify;"><span style="color: hsl(240,75%,60%);"><strong>&nbsp; 11- &nbsp;تسوية الخلافات:</strong></span></h3>
<p style="text-align: justify;">يُسمح لمحاكم ومكاتب التنفيذ بإسطنبول (المركزية) بحل أي خلاف ينشأ عن تنفيذ أو تفسير هذه الاتفاقية.</p>']]);
    }
}
